const categoryList = [
    { name: 'Dog' },
    { name: 'Cat' },
    { name: 'Little Pet' },
    { name: 'Bird' },
    { name: 'Fish' },
    { name: 'Reptile' },
];

const category2List = {
    Dog: [
        "Τροφές Σκύλου",
        "Κλινικές Τροφές Σκύλου",
        "Μεταφορά-Διαμονή",
        "Αξεσουάρ",
        "Υγιεινή",
        "Περιποίηση",
    ],
    Cat: [
        "Τροφές Γάτας",
        "Κλινικές Τροφές Γάτας",
        "Μεταφορά-Διαμονή",
        "Αξεσουάρ",
        "Υγιεινή",
        "Περιποίηση",
    ],
    "Little Pet": [
    "Τροφές Μικρών Ζώων",
    "Κλουβιά & Σπίτια",
    "Αξεσουάρ",
    "Υγιεινή",
  ],
  Bird: [
    "Τροφές Πουλιών",
    "Κλουβιά & Σπίτια",
    "Αξεσουάρ",
    "Υγιεινή",
  ],
  Fish: [
    "Τροφές Ψαριών",
    "Ενυδρεία",
    "Αξεσουάρ",
    "Φιλτράρισμα & Συντήρηση",
  ],
  Reptile: [
    "Τροφές Ερπετών",
    "Τεραριούμ",
    "Αξεσουάρ",
    "Φιλτράρισμα & Συντήρηση",
  ]
};

const subcategoryList = {
    "Τροφές Σκύλου": [
        "Ξηρά τροφή",
        "Υγρή Τροφή & Κονσέρβες",
        "Λιχουδιές",
        "Κόκκαλα",
        "Βιταμίνες-Συμπληρώματα διατροφής",
        "Γάλατα-Μπιμπερό",
      ],
      "Κλινικές Τροφές Σκύλου": [
        "Για αρθρώσεις",
        "Για πέψη",
        "Για δέρμα & τρίχωμα",
        "Για οδοντική υγεία",
      ],
      "Μεταφορά-Διαμονή": [
        "Μεταφορείς",
        "Σπίτια Σκύλων",
        "Κλουβιά Μεταφοράς",
      ],
      "Αξεσουάρ": [
        "Περιλαίμια",
        "Λουριά",
        "Παιχνίδια",
        "Κρεβάτια & Μαξιλάρια",
      ],
      "Υγιεινή": [
        "Σακούλες απορριμμάτων",
        "Πάνες",
        "Καθαριστικά",
        "Σαμπουάν & Μαλακτικά",
      ],
      "Περιποίηση": [
        "Βούρτσες",
        "Ψαλίδια",
        "Στεγνωτήρες",
      ],
      // Similar structure for "Cat"
      "Τροφές Γάτας": [
        "Ξηρά τροφή",
        "Υγρή Τροφή & Κονσέρβες",
        "Λιχουδιές",
        "Βιταμίνες-Συμπληρώματα διατροφής",
      ],
      "Κλινικές Τροφές Γάτας": [
        "Για αρθρώσεις",
        "Για πέψη",
        "Για δέρμα & τρίχωμα",
        "Για οδοντική υγεία",
      ],
      "Μεταφορά-Διαμονή": [
        "Μεταφορείς",
        "Σπίτια Γάτας",
        "Κλουβιά Μεταφοράς",
      ],
      "Αξεσουάρ": [
        "Περιλαίμια",
        "Λουριά",
        "Παιχνίδια",
        "Κρεβάτια & Μαξιλάρια",
      ],
      "Υγιεινή": [
        "Σακούλες απορριμμάτων",
        "Πάνες",
        "Καθαριστικά",
        "Σαμπουάν & Μαλακτικά",
      ],
      "Περιποίηση": [
        "Βούρτσες",
        "Ψαλίδια",
        "Στεγνωτήρες",
      ],
      // "Little Pet" subcategories
      "Τροφές Μικρών Ζώων": [
        "Ξηρά τροφή",
        "Σνακ",
      ],
      "Κλουβιά & Σπίτια": [
        "Κλουβιά",
        "Σπίτια",
      ],
      "Αξεσουάρ": [
        "Τροχοί",
        "Τσάντες μεταφοράς",
      ],
      "Υγιεινή": [
        "Πάνες",
        "Καθαριστικά",
      ],
      // "Bird" subcategories
      "Τροφές Πουλιών": [
        "Σπόροι",
        "Λιχουδιές",
      ],
      "Κλουβιά & Σπίτια": [
        "Κλουβιά",
        "Φωλιές",
      ],
      "Αξεσουάρ": [
        "Κρεμάστρες",
        "Παιχνίδια",
      ],
      "Υγιεινή": [
        "Καθαριστικά",
        "Σαμπουάν",
      ],
      // "Fish" subcategories
      "Τροφές Ψαριών": [
        "Νιφάδες",
        "Σφαιρίδια",
      ],
      "Ενυδρεία": [
        "Γυάλες",
        "Φυτά & Διακοσμητικά",
      ],
      "Αξεσουάρ": [
        "Φίλτρα",
        "Θερμαντήρες",
      ],
      "Φιλτράρισμα & Συντήρηση": [
        "Φίλτρα",
        "Καθαριστικά",
      ],
      // "Reptile" subcategories
      "Τροφές Ερπετών": [
        "Ζωντανή Τροφή",
        "Ξηρά Τροφή",
      ],
      "Τεραριούμ": [
        "Διακοσμητικά",
        "Φυτά",
      ],
      "Αξεσουάρ": [
        "Θερμοστάτες",
        "Λάμπες UVB",
      ],
      "Φιλτράρισμα & Συντήρηση": [
        "Φίλτρα",
        "Καθαριστικά",
      ],
};

export { categoryList, category2List, subcategoryList };